part of 'view.dart';

final List<Map<String, dynamic>> drinks = [
  {
    'id': 0,
    'level': 'صعب',
    'time_ready': 10,
    'time_cook': 1,
    'title_en': 'Mojito ice cream',
    'title_ar': 'موهيتو آيس كريم و رمان',
    'image': 'assets/images/Mojito_ice_cream.jpg',
    'stats': false,
    'ingredients': [
      'تلج وردي (شراب ورد + ماء)',
      'آيس كريم فراولة',
      'حبات رمان',
      'صودا'
    ],
    'steps': [
      'املأ الكوب بالثلج الوردي.',
      'أضف كرات من آيس كريم الفراولة.',
      'زين بالحبات الحمراء للرمان.',
      'أكمل بالصودا.',
      'قدميه بارداً.'
    ],
  },
  {
    'id': 1,
    'level': 'سهل',
    'time_ready': 10,
    'time_cook': 5,
    'title_en': 'Blue Mojito',
    'title_ar': 'موهيتو أزرق',
    'image': 'assets/images/blue_mojito.jpg',
    'stats': false,
    'ingredients': [
      'شرائح ليمون طازج',
      'أوراق نعناع طازجة',
      'سيرب أزرق',
      'عصير ليمون طبيعي',
      'ماء فوار (اسبريت أو صودا)',
      'ثلج أزرق (سيرب أزرق مجمد)'
    ],
    'steps': [
      'ضع شرائح الليمون وأوراق النعناع في قاع كوب طويل.',
      'أضف كمية مناسبة من الثلج الأزرق.',
      'اسكب السيرب الأزرق ثم عصير الليمون الطبيعي.',
      'املأ الكوب بماء الفوار.',
      'قلّب المكونات برفق للحصول على مزيج متجانس.',
      'زين الكوب بشريحة ليمون وأوراق نعناع إضافية.'
    ]
  },
  {
    'id': 2,
    'level': 'سهل', // يمكنك تعديل المستوى بناءً على رأيك
    'time_ready': 10,
    'time_cook': 5,
    'title_en': 'Strawberry Orange Mojito',
    'title_ar': 'موهيتو الفراولة والبرتقال',
    'image': 'assets/images/strawberry_orange_mojito.jpg',
    'ingredients': [
      'أوراق نعناع طازجة',
      'ليمون',
      'شراب فراولة',
      'ثلج وردي',
      'صودا أو سفن أب',
      'عصير برتقال طبيعي'
    ],
    'stats': false,
    'steps': [
      'ضع أوراق النعناع وقطع الليمون في قاع الكوب واهرسهم قليلاً.',
      'أضف شراب الفراولة.',
      'املأ الكوب بالثلج الوردي.',
      'اعصر نصف ليمونة فوق الثلج.',
      'أضف الصودا أو السفن أب.',
      'اكمل بصب عصير البرتقال.',
      'زين بأوراق النعناع الطازجة.'
    ]
  }
];
